## Dataset

In [3]:
import pandas as pd

india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [4]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

### Concat DataFrames

In [9]:
# Note that it retains index number from original DataFrame
df = pd.concat([india_weather, us_weather])
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

### To assign a key for each DataFrame

In [23]:
df = pd.concat([india_weather, us_weather], keys = ['India', 'US'])
df

             city  temperature  humidity
India 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
US    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [24]:
df.loc['India']

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

### To assign new index number

In [25]:
df = pd.concat([india_weather, us_weather], ignore_index = True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

## New Dataset

In [30]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30]
})
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [34]:
humidity_df = pd.DataFrame({
    "city": ["banglore", "mumbai"],
    "humidity": [80, 60]
})
humidity_df

       city  humidity
0  banglore        80
1    mumbai        60

### Concat the DataFrames vertically
- Note that the DataFrames didn't concatenated correctly
- e.g. mumbai joined with banglore

In [35]:
df = pd.concat([temperature_df, humidity_df], axis = 1)
df

       city  temperature      city  humidity
0    mumbai           32  banglore      80.0
1     delhi           45    mumbai      60.0
2  banglore           30       NaN       NaN

### To eliminate above issue we will use index argument to assign correct index to each city

In [37]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30]
}, index = [0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [38]:
humidity_df = pd.DataFrame({
    "city": ["banglore", "mumbai"],
    "humidity": [80, 60]
}, index = [2, 0])
humidity_df

       city  humidity
2  banglore        80
0    mumbai        60

### Now the DataFrames are concatenated correctly

In [39]:
df = pd.concat([temperature_df, humidity_df], axis = 1)
df

       city  temperature      city  humidity
0    mumbai           32    mumbai      60.0
1     delhi           45       NaN       NaN
2  banglore           30  banglore      80.0

### To concat a Series to DataFrame

In [40]:
sr = pd.Series(['humid', 'dry', 'rain'], name = 'event')
sr

0    humid
1      dry
2     rain
Name: event, dtype: object

In [42]:
df = pd.concat([temperature_df, sr], axis = 1)
df

       city  temperature  event
0    mumbai           32  humid
1     delhi           45    dry
2  banglore           30   rain